public class main {
    public static void main(String[] args) {
        int ticket = 2000;
        int money = 20;
        int miles = ticket/money;

        System.out.println(miles);
        
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}